<template>
  <content-component>
    <h1>Main Page</h1>
    Но ещё пару лет назад поверить в эту статистику было бы сложно, ведь когда Next.js только появился на сцене, он был не очень совместим с архитектурой Jamstack, а именно — с предпочтительным в её философии методом статической генерации сайта (SSG).
    Дело в том, что одним из основных принципов работы Next.js является рендеринг на стороне сервера (SSR), и эти два подхода к созданию приложений — SSG и SSR, казалось бы, противоположны, и их невозможно объединить.
    Но в 2020 году в версии Next.js 9.3 появилась улучшенная поддержка SSG, а в 2021-м появилась поддержка гибридной модели, при которой можно пользоваться одновременно и в равной степени свободно как SSG, так и SSR. Поэтому Next.js теперь не такой уж и плохой выбор для архитектуры Jamstack, а даже наоборот — очень популярный.
    Несмотря на огромное многообразие выбора платформ для создания своего сайта или приложения на архитектуре Jamstack, мы считаем Next.js поистине уникальным фреймворком. Почему?
  </content-component>
</template>

<script>
export default {
  name: 'MainPage',
}
</script>
