<template>
  <content-component>
    <h1>{{`Route path: ${$route.path}`}}</h1>
    Чтобы создать User Flow нужно следовать несколько вопросам, чтобы без труда на все ответить. Как выглядит простая форма:
    Кто Ваш пользователь? Опишите его, чем он руководствуется для достижения своей цели? Идеально, если вы будете полагаться на наблюдения за поведением живых пользователей (на самом деле, внутри продукта или, лучше, комплексно);
    Опишите ход действий пользователя, покажите все с точки А и до точки Б. Это создаст историю, рассказ должен быть максимально ясным и понятным, чтобы показать нам полную картину взаимодействия пользователя с продуктом.
    Визуализация блока. Шаг за шагом вам стоит показать весь путь пользователя в мельчайших деталях. Алгоритм визуализации такой же, как и в случае с классическими блок-схемами, которые вы смешиваете с экранами интерфейса.
    Для составления схемы можно пользоваться списком необходимых и достаточных элементов из классических блок-схем, представленных на картинке, или использовать стандарт BPMN — он ориентирован как на технических специалистов, так и на бизнес-пользователей.
  </content-component>
</template>

<script>
export default {
  name: 'ReportPage',
}
</script>
